let verses ={
  iau4v:'<h5>यशैया 43:18-19</h5><p>बितेका कुराहरूलाई भूल, उहिलेका कुराहरूलाई विचार नगर। हेर, म एउटा नयाँ कुरो गर्दैछु! त्‍यो अब हुन आउँछ। के तिमीहरू त्‍यो देख्‍दैनौ? म मरुभूमिमा एउटा बाटो र रूखो जमिनमा खोलाहरू बनाउँदैछु।</p>',
  mffg7:'<h5>हिब्रू 10:24-25/h5><p>हामी एउटाले अर्कालाई प्रेम र असल कामको निम्‍ति कसरी उत्‍साहित गराउने त्‍यस कुरामाथि विचार गरौं। कति जनाको सङ्गतिमा नजाने बानी हुन्‍छ, तर हामीचाहिँ एकसाथ भेला हुन नछोडौं। तर प्रभुको दिन नजिक आइरहेको तिमीहरूले देखेका हुनाले एउटाले अर्कालाई झन्‌ प्रोत्‍साहन देओ।</p>',
  xoejn:'<h5>यर्मिया 29:11</h5><p> "किनभने जुन योजनाहरू मैले तिमीहरूका निम्‍ति बनाएको छु, ती म जान्‍दछु," परमप्रभु भन्‍नुहुन्‍छ। "ती तिमीहरूका उन्‍नतिको निम्‍ति हुन्, नोक्‍सानीको निम्‍ति होइनन्, तिमीहरूलाई आशा र भविष्‍य दिनलाई।"</p>',
  a6u2m:'<h5>रोमी 12:1</h5><p>यसकारण भाइ हो, परमेश्‍वरको कृपालाई ध्‍यानमा राखी म तिमीहरूलाई अनुरोध गर्दछु, कि तिमीहरूको आत्‍मिक उपासनाको रूपमा आ-आफ्‍ना शरीरलाई पवित्र र परमेश्‍वरलाई ग्रहणयोग्‍य हुने जिउँदो बलिको रूपमा अर्पण गर।</p>',
  qh2y4:'<h5>हितोपदेश 3:5-6</h5><p>आफ्‍नो सारा हृदयले परमेश्‍वरमा भरोसा राख्, र तेरो आफ्‍नै समझशक्तिमा भर नपर्‌ आफ्‍ना सारा मार्गमा उहाँलाई सम्‍झी, र उहाँले तेरा मार्गहरू सोझा तुल्‍याइदिनुहुनेछ।</p>',
  b2w8c:'<h5> सपन्‍याह 3:17 </h5><p> परमप्रभु तेरा परमेश्‍वर तँसित हुनुहुन्‍छ। उहाँ बचाउनलाई सामर्थी हुनुहुन्‍छ। उहाँ तँसित अत्‍यन्‍तै आनन्‍दित हुनुहुन्‍छ। उहाँले आफ्‍नो प्रेममा तँलाई शान्‍त पार्नुहुनेछ। गीत गाएर उहाँ तेरा बारेमा रमाउनुहुनेछ।</p>',
  wa3op:'<h5>हितोपदेश 3:5-7</h5><p>आफ्‍नो सारा हृदयले परमेश्‍वरमा भरोसा राख्, र तेरो आफ्‍नै समझशक्तिमा भर नपर्‌ आफ्‍ना सारा मार्गमा उहाँलाई सम्‍झी, र उहाँले तेरा मार्गहरू सोझा तुल्‍याइदिनुहुनेछ।</p>',
  gk0eq:'<h5>उपदेशक 3:11</h5><p>उहाँले हरेक कुरालाई आफ्‍नो समयमा सुन्‍दर बनाउनुभएको छ। उहाँले मानिसका हृदयमा अनन्‍तता पनि राखिदिनुभएको छ। तापनि तिनीहरूले परमेश्‍वरले आदिदेखि अन्‍त्‍यसम्‍म के गर्नुभएको छ त्‍यसको गहिराइलाई बुझ्‍न सक्‍दैनन्‌।</p>',
  b4tni:'<h5>यशैया 41:10</h5><p>यसैले नडरा, किनकि म तँसित छु। निरुत्‍साहित नहो, किनकि म तेरा परमेश्‍वर हुँ। म तँलाई बलियो पार्नेछु। म तँलाई सहायता गर्नेछु। मेरो धार्मिकताको दाहिने हातले म तँलाई सम्हाल्‍नेछु।</p>',
  x9xva:'<h5>मत्ती 6:33</h5><p>तर पहिले उहाँको राज्‍य र उहाँका धार्मिकताको खोजी गर, र यी सबै थोक तिमीहरूका निम्‍ति थपिनेछन्‌।</p>',
  ii1af:'<h5>यहोशू 1:9</h5><p>तँलाई मेरो आज्ञा छ बलियो र खूबै साहसी हो, नडरा, निराश नहो, किनकि तँ जहाँ गए पनि, परमप्रभु तेरा परमेश्‍वर, तेरो साथमा हुनुहुनेछ।</p>',
  z46es:'<h5> इजकिएल 36:25</h5><p>म तिमीहरूमाथि शुद्ध पानी छर्किदिनेछु, र तिमीहरू शुद्ध हुनेछौ। तिमीहरूका सबै अशुद्धतादेखि र तिमीहरूका सबै मूर्तिहरूदेखि म तिमीहरूलाई शुद्ध तुल्‍याउनेछु।</p>',
  s6b39:'',
  gtgy4:'',
  zjlu7:'',
  hf07p:'',
  l22k3:'',
  wflej:'',
  r74xz:'',
  tb1n0:'',
  mw9uy:'',
  z8866:'',
  uoxzs:'',
  hqimh:'',
  up42d:'',
  m3h8b:'',
  g0xfp:'',
  g1nl8:'',
  op5qe:'',
  hofc4:'',
  veyrb:'',
  dg6x1:'',
  bipp0:'',
  i17i9:'',
  fjwo3:'',
  s0y3a:'',
  t2rkc:'',
  l37aw:'',
  cosv5:'',
  lb2dc:'',
}


function processPin(){
  let pin = document.getElementById("pin").value;
  let storedPin  = Object.keys(verses);
  for(i=0; i<storedPin.length;i++){
    if(pin == storedPin[i]){
      document.getElementById("verse").innerHTML = verses[pin];
      document.getElementById("verse").style = 'display:block;';
      document.getElementById("login").style = 'display:none;';
      event.preventDefault()
      return;
    }
  }
}
